[{"start":0,"end":6880,"text":"Unified Payment Interface or UPI has revolutionized real-time payments in India. It's fast, secure,","language":"english"},{"start":6880,"end":12720,"text":"and available 24x7 allowing you to instantly send money just using your mobile number or UPI ID.","language":"english"},{"start":13279,"end":17760,"text":"No more complex bank details or delays. UPI transfers money directly between bank","language":"english"},{"start":17760,"end":22159,"text":"accounts in real-time. And best of all, UPI is free for users,","language":"english"},{"start":22159,"end":26639,"text":"unlike PayPal which charges fees for transactions, especially international ones.","language":"english"},{"start":26639,"end":30319,"text":"In today's video, we break down how UPI works in digital payments,","language":"english"},{"start":30319,"end":34080,"text":"compare it with global systems like PayPal, Alipay, Venmo, and Zelle,","language":"english"},{"start":34080,"end":38400,"text":"and wrap up by exploring where India's UPI fits into the global payments ecosystem.","language":"english"},{"start":42639,"end":46720,"text":"Traditionally, if you wanted to send money to someone's bank account, you would need to know","language":"english"},{"start":46720,"end":52080,"text":"their bank account number, the bank name, the branch name, and the IFSC code,","language":"english"},{"start":52080,"end":57279,"text":"which is like a postal code for banks in India. UPI simplifies all of this.","language":"english"},{"start":57279,"end":61520,"text":"It's like sending a letter, but instead of a full address, you just need a short code","language":"english"},{"start":61520,"end":67279,"text":"called a UPI ID, or even just their mobile number, and the system takes care of the rest.","language":"english"},{"start":67279,"end":72239,"text":"In seconds, the money reaches the right account. What sets UPI apart from other systems is that","language":"english"},{"start":72239,"end":76480,"text":"it doesn't hold your funds in a middle layer like a digital wallet before they are transferred.","language":"english"},{"start":77120,"end":82800,"text":"UPI enables real-time bank-to-bank transfers directly from one account to another. It's","language":"english"},{"start":82800,"end":86319,"text":"not just secure, it's efficient and cost-free for users.","language":"english"},{"start":86319,"end":90080,"text":"Now before we get into the comparisons, let me remind you that I have previously","language":"english"},{"start":90080,"end":93440,"text":"made a video explaining how payment gateways and payment processors work.","language":"english"},{"start":94080,"end":98080,"text":"So do check that out for a more detailed breakdown of how different payment technologies","language":"english"},{"start":98080,"end":103440,"text":"operate behind the scenes. But at a high level, think of a payment gateway like a checkout","language":"english"},{"start":103440,"end":108879,"text":"counter at a store. It authorizes and processes your payment, whether you are using a card or","language":"english"},{"start":108879,"end":113839,"text":"bank account. The payment processor on the other hand handles the behind-the-scenes work,","language":"english"},{"start":113839,"end":117199,"text":"actually transferring the money between your account and the merchant's account.","language":"english"},{"start":117839,"end":120160,"text":"PayPal and Stripe are examples of both.","language":"english"},{"start":120160,"end":125839,"text":"UPI is neither strictly a payment processor nor a payment gateway. It functions more as","language":"english"},{"start":125839,"end":130559,"text":"a payment infrastructure or system that facilitates real-time bank-to-bank transfers.","language":"english"},{"start":130559,"end":135520,"text":"It's an interbank payment system built by the National Payments Corporation of India or NPCI.","language":"english"},{"start":136240,"end":142399,"text":"UPI acts as a network allowing real-time transfers between bank accounts using a mobile phone. It","language":"english"},{"start":142399,"end":146960,"text":"doesn't really process payments in the traditional sense like a credit card processor such as Visa","language":"english"},{"start":146960,"end":151440,"text":"or MasterCard. Rather, it facilitates direct instantaneous bank-to-bank transfers.","language":"english"},{"start":151440,"end":156320,"text":"This diagram explains the flow of UPI transactions. Let's say you are using Google Pay.","language":"english"},{"start":156320,"end":161600,"text":"When you initiate a transfer, Google Pay talks to your bank, let's say ICICI Bank in India,","language":"english"},{"start":162160,"end":168080,"text":"through something called the NPCI which is the backbone of UPI. NPCI then checks if everything","language":"english"},{"start":168080,"end":172800,"text":"is okay, like whether you have enough balance and ensures the money moves directly from your","language":"english"},{"start":172800,"end":178639,"text":"account to the recipient's bank account, say HDFC Bank in India, and that too within seconds.","language":"english"},{"start":179679,"end":185039,"text":"Let's further break it down step by step. Say the payer or the customer opens their PSP app.","language":"english"},{"start":185839,"end":191360,"text":"Now, a PSP or Payment Service Provider helps connect customers with their bank to complete","language":"english"},{"start":191360,"end":197839,"text":"transactions. For instance, in India, Google Pay acts as a PSP, so when you initiate a payment,","language":"english"},{"start":197839,"end":202559,"text":"it interacts with your bank to process it securely. In fact, Google's UPI app is linked","language":"english"},{"start":202559,"end":207759,"text":"with various banks. Similarly, PhonePe in India was linked with Yes Bank as PSP initially.","language":"english"},{"start":207759,"end":212960,"text":"Now, ICICI Bank in India. Once authenticated, the payer's PSP sends a payment request to the","language":"english"},{"start":212960,"end":219039,"text":"UPI network, NPCI. This request includes the payer's and payee's UPI IDs and the payment","language":"english"},{"start":219039,"end":224639,"text":"details. The UPI network first resolves the payee's address, mapping it to their bank account","language":"english"},{"start":224639,"end":229360,"text":"via their PSP. The payee's PSP verifies the payee's details and responds back.","language":"english"},{"start":230000,"end":235360,"text":"The UPI network then sends a debit request to the payer's bank, also known as the remitter or","language":"english"},{"start":235360,"end":240240,"text":"issuer bank, asking for authorization to detect the specified amount from the payer's account.","language":"english"},{"start":240240,"end":244880,"text":"The issuer bank processes the debit request, checking if the payer has sufficient funds","language":"english"},{"start":244880,"end":249520,"text":"and if the transaction is valid. It sends a confirmation response back to the UPI network.","language":"english"},{"start":250160,"end":254160,"text":"And after receiving the confirmation, the UPI network sends a credit request to the","language":"english"},{"start":254160,"end":258799,"text":"beneficiary's bank, also called the payee's bank, informing it to credit the amount into","language":"english"},{"start":258799,"end":262799,"text":"the payee's account. The beneficiary bank processes the credit request and confirms","language":"english"},{"start":262799,"end":267440,"text":"the successful transfer to the UPI network. The network then relays the successful transaction","language":"english"},{"start":267440,"end":272959,"text":"status back to both the payer's PSP and the payee's PSP, completing the transaction.","language":"english"},{"start":273760,"end":279519,"text":"In simpler terms, UPI is the infrastructure that banks and apps like Google Pay or PhonePay use","language":"english"},{"start":279519,"end":285679,"text":"to directly move money between accounts. UPI is not a digital wallet either. Money is transferred","language":"english"},{"start":285679,"end":290799,"text":"directly between bank accounts. Whereas in digital wallets, funds are stored in an intermediate","language":"english"},{"start":290799,"end":295519,"text":"balance before being used for. One more important thing in this UPI diagram is that the customer","language":"english"},{"start":295600,"end":300720,"text":"also creates a virtual payment address or VPA through the PSP app, which links directly to","language":"english"},{"start":300720,"end":305760,"text":"their bank account. Once confirmed, the VPA allows secure payments without sharing sensitive bank","language":"english"},{"start":305760,"end":312239,"text":"details. For QR code-based payments, the customer scans the QR code, which contains the payee's VPA","language":"english"},{"start":312239,"end":318480,"text":"or details. It authorizes the payment with their MPIN or mobile PIN, and the request is sent to","language":"english"},{"start":318480,"end":324480,"text":"the UPI network via the PSP, following the regular transaction flow. Now, UPI operates through an","language":"english"},{"start":324480,"end":329679,"text":"API-based architecture. Every time you use apps like Google Pay, PhonePay or Paytm in India,","language":"english"},{"start":329679,"end":335839,"text":"these apps are calling NPCI's APIs. These APIs do everything from verifying user identities","language":"english"},{"start":335839,"end":341359,"text":"through UPI PINs to making sure the money lands in the correct account. Once that is done,","language":"english"},{"start":341359,"end":346399,"text":"the transaction is confirmed by both the sender's and receiver's banks, all in a blink of an eye.","language":"english"},{"start":346399,"end":351119,"text":"Behind the scenes, banks act as payment service providers or PSPs. So for instance,","language":"english"},{"start":351119,"end":356239,"text":"when you use Google Pay, ICICI Bank might be processing the transaction as its PSP,","language":"english"},{"start":356239,"end":360880,"text":"while PhonePay might partner with Yes Bank. These banks handle your request and interact","language":"english"},{"start":360880,"end":367279,"text":"with NPCI's platform to complete the transfers. To understand how UPI fits into the bigger picture,","language":"english"},{"start":367279,"end":372079,"text":"let's compare it to other widely used payment systems around the world. Each of these systems","language":"english"},{"start":372079,"end":377200,"text":"has a slightly different structure, but they all aim to provide seamless money transfers.","language":"english"},{"start":377200,"end":383279,"text":"And here is how they stack up. PayPal is a household name in the global payments landscape,","language":"english"},{"start":383279,"end":388640,"text":"serving as a digital wallet, a payment gateway, and a payment processor. As a digital wallet,","language":"english"},{"start":388640,"end":393119,"text":"PayPal allows users to store funds and use them for future purchases or transfers.","language":"english"},{"start":393760,"end":398399,"text":"As a payment gateway, it connects merchants to financial institutions, facilitating online","language":"english"},{"start":398399,"end":403200,"text":"payments. And as a payment processor, it handles actual transactions by routing payments through","language":"english"},{"start":403200,"end":408559,"text":"card networks or bank accounts. Unlike UPI, PayPal typically holds funds in an intermediate","language":"english"},{"start":408559,"end":413440,"text":"balance, your PayPal wallet, before transferring it to your bank account. The step introduces an","language":"english"},{"start":413440,"end":420000,"text":"extra layer that UPI bypasses entirely. As UPI facilitates instant bank-to-bank transfers","language":"english"},{"start":420000,"end":424559,"text":"with no intermediary balance. For example, when using PayPal, you will usually link a bank account,","language":"english"},{"start":424559,"end":429200,"text":"debit card, or credit card to PayPal. When you receive a payment, the money is first held in","language":"english"},{"start":429200,"end":434160,"text":"your PayPal balance. From there, you can transfer it to your bank account or use it directly for","language":"english"},{"start":434160,"end":440160,"text":"purchases. In contrast, UPI transfers funds immediately from one bank account to another","language":"english"},{"start":440160,"end":444880,"text":"without holding money in a wallet. Alipay is China's leading payment system, and is widely","language":"english"},{"start":444880,"end":450559,"text":"used for everything from shopping online to paying with QR codes in stores. But unlike UPI,","language":"english"},{"start":450559,"end":455920,"text":"it holds funds in a wallet before spending or transferring, adding an extra layer of friction","language":"english"},{"start":455920,"end":461359,"text":"that UPI skips. Venmo is a social P2P payment platform that was popular in the US. You link","language":"english"},{"start":461359,"end":466000,"text":"your bank account, debit card, or credit card to send and receive payments between friends or","language":"english"},{"start":466000,"end":470640,"text":"businesses. And there is even a social feed to share transaction details with contacts.","language":"english"},{"start":470640,"end":476160,"text":"However, like PayPal, Venmo holds money in your Venmo balance until you transfer it to your bank.","language":"english"},{"start":476880,"end":481760,"text":"While Venmo works similarly to UPI in terms of peer-to-peer payments, it often acts as an","language":"english"},{"start":481760,"end":486480,"text":"intermediary, holding money in your Venmo balance. Apple Pay and Google Pay allow users","language":"english"},{"start":486480,"end":490559,"text":"to make payments using their mobile phones by linking their bank account or cards.","language":"english"},{"start":490559,"end":495679,"text":"They work for in-store purchases using NFC or Near Field Communication, as well as for","language":"english"},{"start":495679,"end":499839,"text":"online payments. They use encryption and tokenization to ensure secure payments,","language":"english"},{"start":499839,"end":505359,"text":"especially for contactless purchases. But both Apple and Google Pay are primary digital wallets","language":"english"},{"start":505359,"end":510720,"text":"for storing card details. In India, however, there is a UPI version of Google Pay, which","language":"english"},{"start":510720,"end":515919,"text":"integrates with the UPI infrastructure for direct bank-to-bank transfers. But in other countries,","language":"english"},{"start":515919,"end":520320,"text":"like in the US, it functions more like Apple Pay. UPI is actually similar to Zelle,","language":"english"},{"start":520320,"end":524880,"text":"a real-time bank transfer system used in the US, but their infrastructure differ.","language":"english"},{"start":524880,"end":531119,"text":"UPI is managed by NPCI in India. It operates via API-based architecture that handles massive","language":"english"},{"start":531119,"end":537440,"text":"volumes with low latency. Zelle, on the other hand, operates in the US using the ACH network.","language":"english"},{"start":537440,"end":543119,"text":"While both systems offer peer-to-peer transfers, UPI's API infrastructure allows for faster,","language":"english"},{"start":543119,"end":548640,"text":"real-time bank settlements, whereas Zelle's ACH network settles transactions in near real-time.","language":"english"},{"start":548640,"end":552960,"text":"And if you're interested in learning more about Zelle and similar real-time payment systems,","language":"english"},{"start":552960,"end":558320,"text":"or want to dive deeper into how UPI was built, in my next video, I'll break down how a system like","language":"english"},{"start":558320,"end":563599,"text":"UPI can be built from scratch. We'll explore the APIs, infrastructure, and all the critical parts","language":"english"},{"start":563599,"end":568320,"text":"you need to consider. So don't forget to like and subscribe if you want to dive deeper into","language":"english"},{"start":568320,"end":577440,"text":"the world of payment system design.","language":"english"}]